In [4]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline

import itertools
import warnings
warnings.filterwarnings('ignore')

In [5]:
filename = '/home/jovyan/work/data/visa/data_sample.csv'
data_sample = pd.read_csv(filename)
df_data = data_sample.copy()

In [13]:
df = df_data[['CustomerId','Geography','Gender','CreditScore','Age','Balance','NumOfProducts','HasCrCard','IsActiveMember','EstimatedSalary']].copy()
df.head(5)

,CustomerId,Geography,Gender,CreditScore,Age,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,15634602,France,Female,619,42,0.00,1,1,1,101348.88
1,15647311,Spain,Female,608,41,83807.86,1,0,1,112542.58
2,15619304,France,Female,502,42,159660.80,3,1,0,113931.57
3,15701354,France,Female,699,39,0.00,2,0,0,93826.63
4,15737888,Spain,Female,850,43,125510.82,1,1,1,79084.10

# DATA PREPROCESSING

In [14]:
def missing_values_table(df):
    mis_val = df.isnull().sum()
    mis_val_percent = 100 * df.isnull().sum() / len(df)
    mis_val_table = pd.concat([mis_val, mis_val_percent], axis=1)
    mis_val_table_ren_columns = mis_val_table.rename(
    columns = {0 : 'Missing Values', 1 : '% of Total Values'})
    mis_val_table_ren_columns = mis_val_table_ren_columns[
        mis_val_table_ren_columns.iloc[:,1] != 0].sort_values(
    '% of Total Values', ascending=False).round(1)
    print ("Your selected dataframe has " + str(df.shape[1]) + " columns.\n"      
        "There are " + str(mis_val_table_ren_columns.shape[0]) +
            " columns that have missing values.")
    return mis_val_table_ren_columns

In [15]:
def unqiue_values_table(df):
    unq_val = df.nunique()
    unq_val_percent = 100 * df.nunique() / len(df)
    unq_val_table = pd.concat([unq_val, unq_val_percent], axis=1)
    unq_val_table_ren_columns = unq_val_table.rename(
    columns = {0 : 'Unique Values', 1 : '% of Total Values'})
    unq_val_table_ren_columns = unq_val_table_ren_columns[
        unq_val_table_ren_columns.iloc[:,1] != 0].sort_values(
    'Unique Values', ascending=False).round(2)
    print ("Your selected dataframe has " + str(df.shape[0]) + " rows "       
        "and " + str(df.shape[1]) + " columns.")
    return unq_val_table_ren_columns

In [16]:
def date_conversion(df):
    df['created_date'] = pd.to_datetime(df['created_date'])
    return df

# EXPLORATORY DATA ANALYSIS

In [22]:
df_data.dtypes

CustomerId           int64
Surname             object
CreditScore          int64
Geography           object
Gender              object
Age                  int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
dtype: object

In [20]:
df_data[['CreditScore','Age','Balance','NumOfProducts','HasCrCard','HasCrCard','IsActiveMember','EstimatedSalary']].describe()

,CreditScore,Age,Balance,NumOfProducts,HasCrCard,HasCrCard,IsActiveMember,EstimatedSalary
count,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.00000,10000.000000,10000.000000
mean,650.528800,38.921800,76485.889288,1.530200,0.70550,0.70550,0.515100,100090.239881
std,96.653299,10.487806,62397.405202,0.581654,0.45584,0.45584,0.499797,57510.492818
min,350.000000,18.000000,0.000000,1.000000,0.00000,0.00000,0.000000,11.580000
25%,584.000000,32.000000,0.000000,1.000000,0.00000,0.00000,0.000000,51002.110000
50%,652.000000,37.000000,97198.540000,1.000000,1.00000,1.00000,1.000000,100193.915000
75%,718.000000,44.000000,127644.240000,2.000000,1.00000,1.00000,1.000000,149388.247500
max,850.000000,92.000000,250898.090000,4.000000,1.00000,1.00000,1.000000,199992.480000

#### Missing Values

In [18]:
missing_values_table(df_data)

Your selected dataframe has 11 columns.
There are 0 columns that have missing values.

Empty DataFrame
Columns: [Missing Values, % of Total Values]
Index: []

#### Unique Values

In [19]:
unqiue_values_table(df_data)

Your selected dataframe has 10000 rows and 11 columns.

                 Unique Values  % of Total Values
CustomerId               10000             100.00
EstimatedSalary           9999              99.99
Balance                   6382              63.82
Surname                   2932              29.32
CreditScore                460               4.60
Age                         70               0.70
NumOfProducts                4               0.04
Geography                    3               0.03
Gender                       2               0.02
HasCrCard                    2               0.02
IsActiveMember               2               0.02